R3#
R3#
R3#
R3#
R3#
R3#
R3#
R3#
R3#
R3#
R3#
R3#
R3#
R3#
R3#
R3#
R3#
R3#
R3#
R3#
R3#conf t
Enter configuration commands, one per line.  End with CNTL/Z.
R3(config)#int f0/0
R3(config-if)#sh
R3(config-if)#
*Mar 21 17:16:23.763: %HSRP-5-STATECHANGE: FastEthernet0/0 Grp 0 state Standby -> Init
R3(config-if)#
*Mar 21 17:16:25.751: %LINK-5-CHANGED: Interface FastEthernet0/0, changed state to administratively down
*Mar 21 17:16:26.751: %LINEPROTO-5-UPDOWN: Line protocol on Interface FastEthernet0/0, changed state to down
R3(config-if)#end
R3#debug standby events protocol
HSRP Events debugging is on
    (protocol)
R3#debug standby packe terse
HSRP Packets debugging is on
    (Coup, Resign)
R3#debug standby packe hello
HSRP Packets debugging is on
    (Hello, Coup, Resign)
R3#
*Mar 21 17:16:34.119: %SYS-5-CONFIG_I: Configured from console by console
R3#conf t
Enter configuration commands, one per line.  End with CNTL/Z.
R3(config)#int f0/0
R3(config-if)#no sh
R3(config-if)#
*Mar 21 17:16:58.611: HSRP: Fa0/0 Grp 0 Init: a/HSRP enabled
*Mar 21 17:16:58.611: HSRP: Fa0/0 Grp 0 Init -> Listen
*Mar 21 17:16:59.479: HSRP: Fa0/0 Grp 0 Hello  in  192.168.1.2 Active  pri 100 vIP 192.168.1.254
*Mar 21 17:16:59.483: HSRP: Fa0/0 Grp 0 Active router is 192.168.1.2
*Mar 21 17:16:59.483: HSRP: Fa0/0 Grp 0 Hello  in  192.168.1.1 Standby pri 100 vIP 192.168.1.254
*Mar 21 17:16:59.483: HSRP: Fa0/0 Grp 0 Listen: l/Hello rcvd from lower pri Standby router (100/192.168.1.1)
*Mar 21 17:16:59.487: HSRP: Fa0/0 Grp 0 Standby router is 192.168.1.1
*Mar 21 17:16:59.487: HSRP: Fa0/0 Grp 0 Listen -> Speak
*Mar 21 17:16:59.487: HSRP: Fa0/0 Grp 0 Hello  out 192.168.1.3 Speak   pri 100 vIP 192.168.1.254
R3(config-if)#
*Mar 21 17:16:59.599: %LINK-3-UPDOWN: Interface FastEthernet0/0, changed state to up
R3(config-if)#
*Mar 21 17:17:00.599: %LINEPROTO-5-UPDOWN: Line protocol on Interface FastEthernet0/0, changed state to up
R3(config-if)#
*Mar 21 17:17:01.483: HSRP: Fa0/0 Grp 0 Hello  in  192.168.1.2 Active  pri 100 vIP 192.168.1.254
*Mar 21 17:17:02.447: HSRP: Fa0/0 Grp 0 Hello  out 192.168.1.3 Speak   pri 100 vIP 192.168.1.254
R3(config-if)#
*Mar 21 17:17:03.727: HSRP: Fa0/0 Grp 0 Hello  in  192.168.1.2 Active  pri 100 vIP 192.168.1.254
R3(config-if)#
*Mar 21 17:17:05.231: HSRP: Fa0/0 Grp 0 Hello  out 192.168.1.3 Speak   pri 100 vIP 192.168.1.254
R3(config-if)#
*Mar 21 17:17:06.539: HSRP: Fa0/0 Grp 0 Hello  in  192.168.1.2 Active  pri 100 vIP 192.168.1.254
R3(config-if)#
*Mar 21 17:17:08.047: HSRP: Fa0/0 Grp 0 Hello  out 192.168.1.3 Speak   pri 100 vIP 192.168.1.254
*Mar 21 17:17:08.995: HSRP: Fa0/0 Grp 0 Hello  in  192.168.1.2 Active  pri 100 vIP 192.168.1.254
*Mar 21 17:17:09.775: HSRP: Fa0/0 Grp 0 Speak: d/Standby timer expired (192.168.1.1)
*Mar 21 17:17:09.775: HSRP: Fa0/0 Grp 0 Standby router is local, was 192.168.1.1
*Mar 21 17:17:09.775: HSRP: Fa0/0 Grp 0 Speak -> Standby
*Mar 21 17:17:09.775: %HSRP-5-STATECHANGE: FastEthernet0/0 Grp 0 state Speak -> Standby
R3(config-if)#
*Mar 21 17:17:09.775: HSRP: Fa0/0 Grp 0 Hello  out 192.168.1.3 Standby pri 100 vIP 192.168.1.254
R3(config-if)#
*Mar 21 17:17:11.647: HSRP: Fa0/0 Grp 0 Hello  in  192.168.1.2 Active  pri 100 vIP 192.168.1.254
*Mar 21 17:17:12.271: HSRP: Fa0/0 Grp 0 Hello  out 192.168.1.3 Standby pri 100 vIP 192.168.1.254
R3(config-if)#end
R3#
*Mar 21 17:17:14.067: HSRP: Fa0/0 Grp 0 Hello  in  192.168.1.2 Active  pri 100 vIP 192.168.1.254
R3#
*Mar 21 17:17:14.835: %SYS-5-CONFIG_I: Configured from console by console
R3#un all
*Mar 21 17:17:15.231: HSRP: Fa0/0 Grp 0 Hello  out 192.168.1.3 Standby pri 100 vIP 192.168.1.254
R3#un all
All possible debugging has been turned off
R3#
*Mar 21 17:17:16.715: HSRP: Fa0/0 Grp 0 Hello  in  192.168.1.2 Active  pri 100 vIP 192.168.1.254
R3#
